# ==============================================================================================
# 1. 风险度量
# ==============================================================================================
# 例：损失的均值为100，标准差为223.607
# 用正态分布，帕累托分布和 Weibull 分布计算在 90%，99% 和 99.9% 水平的 VaR
library(actuar)
q <- c(0.90,0.99,0.999)
varNorm <- qnorm(q, mean = 100, 223.607) # 正态分布
varPar <- actuar::qpareto(q, scale = 120, shape = 2.2) # 帕累托分布
varWei <- qweibull(q, shape = 0.5, scale = 50)  # Weibull分布

result <- data.frame(q, varNorm, varPar,varWei)
result


